Table of Contents
 Class WarningMessage
Namespace
IdeaRS.OpenModel.Message
Assembly
IdeaRS.OpenModel.dll
Open Warning message
[Obfuscation(Feature = "renaming")]
[DataContract]
public class WarningMessage : OpenMessage
Inheritance
object
OpenObject
OpenMessage
WarningMessage
Inherited Members
 OpenMessage.Create(MessageNumber, OpenObject, string, string, OpenMessage)
 OpenMessage.Number
 OpenMessage.InnerMessage
 OpenMessage.Description
 OpenMessage.Object
 OpenMessage.PropertyName
 OpenMessage.PropertyValue
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 WarningMessage()
Constructor
public WarningMessage()
 WarningMessage(MessageNumber, OpenObject, string, string, OpenMessage)
Constructor
public WarningMessage(MessageNumber number, OpenObject openObject, string propertyName, string description, OpenMessage innerMessage = null)
Parameters
number MessageNumber
Number of the message
openObject OpenObject
Affected object
propertyName string
Affected property
description string
Description of the message
innerMessage OpenMessage
Inner message
Properties
 Message
Gets the Message
public override string Message { get; }
Property Value
string
 Edit this page